#+TITLE: Python学习笔记
#+AUTHOR: Micky Ching
#+OPTIONS: H:4 ^:nil
#+LATEX_CLASS: latex-doc
#+PAGE_TAGS: python

*** 属性
#+BEGIN_SRC python :results output :exports both
def sum_args(*nums):
    '''accept arbitrary numerical arguments and return their sum'''
    return sum(nums)

print sum_args.__name__
print sum_args.__doc__
print sum_args(1, 2, 3)
#+END_SRC

#+RESULTS:
: sum_args
: accept arbitrary numerical arguments and return their sum
: 6

*** 生成器
#+BEGIN_SRC python
yield expression
#+END_SRC

#+BEGIN_SRC python :results output :exports both
def updown(n):
    for x in range(n):
        yield x
    for x in range(n - 1, -1, -1):
        yield x
for i in updown(10):
    print i,
#+END_SRC

#+RESULTS:
: 0 1 2 3 4 5 6 7 8 9 9 8 7 6 5 4 3 2 1 0

*** 类的方法
要实现类的方法，需要添加装饰器修饰：
#+BEGIN_SRC python :exports both :results output
class Example(obejct):
    @staticmethod
    def static_print(os):
        print os
#+END_SRC

特殊方法：
- __new__ :: 创建对象实例
- __init__ :: 初始化对象状态
- __del__ :: 对象回收前调用

Python提供了两个函数来判定类型关系：
- issubclass(a, base) :: 判断a是否是base的继承
- isinstance(a, class) :: 判断a是否是class的实例

多重继承MRO(method resolution order)：从下到上，从左到右。
#+BEGIN_SRC python :exports both :results output
class A(object):
    def print_a(self):
        print "a:a"
class B(object):
    def print_a(self):
        print "b:a"
    def print_b(self):
        print "b:b"

class C(A, B):
    def print_c(self):
        base = super(C, self)
        base.print_a()
        base.print_b()
C().print_c()
#+END_SRC

#+RESULTS:
: a:a
: b:b

Python也支持抽象类，只需要添加修饰即可，
派生类必须实现所有抽象函数/属性才能实例化：
#+BEGIN_SRC python
from abc import ABCMeta, abstractmethod, abstractproperty
class AbsExample(object):
    __metaclass__ = ABCMeta
    @abstractmethod
    def print_id(self):
        pass

    name = abstractproperty()

class Example(AbsExample):
    def print_id(self):
        print "id"
    name = property(lambda s: s._name,
                    lambda s, v: setattr(s, "_name", v))

e = Example()
#+END_SRC

Python还有一个特性叫开放类，可以在运行期增加/删除对象成员。
#+BEGIN_SRC python :exports both :results output
def print_id(self):
    print self.id

def print_class_id(cls):
    print "class: ", cls

def print_static():
    print "static"

class User(object):
    def __init__(self):
        self.id = "self id"

User.print_id = print_id
User.print_class_id = classmethod(print_class_id)
User.print_static = staticmethod(print_static)
u = User()
u.print_id()
User.print_class_id()
User.print_static()
#+END_SRC

#+RESULTS:
: self id
: class:  <class '__main__.User'>
: static

修改字段要用指定函数：
- setattr(obj, "name", value) :: =u.name = value=
- hasattr(obj, "name") :: =obj.__dict__["name"]=
- getattr(obj, "name", None) :: 如果未找到返回None
- delattr(obj, "name") :: =del obj.__dict__["name"]=

索引操作符 =[]= 也可以重载，
自定义 =__setitem__=、=__getitem__= 和 =__delitem__= 即可。
函数对象/仿函数通过定义 =__call__= 来重载。

- __getattr__ :: 访问不存在的成员
- __setattr__ :: 对成员赋值
- __delattr__ :: 删除成员
- __getattribute__ :: 访问任何存在或不存在的成员，包括 =__dict__=
在定义这些函数的时候，在里面不能调用 =setattr=、=getattr= 等函数，
会造成死循环，因此只能直接访问 =__dict__=。
而 =__getattribute__= 更狠，会拦截 =__dict__=，
所以它唯一能调用的就是基类的 =__getattribute__=。

*** 循环分支
下面语句的else表示完整遍历了循环，无论怎样，看上去很怪。
从形式上看，没有执行循环去访问else更加合理。
#+BEGIN_SRC python :exports both :results output
while 0:
    pass
else:
    print "over all"
#+END_SRC

#+RESULTS:
: over all

*** 慎用 =__del__=
文章 [[http://www.708luo.com/posts/2015/04/python-del-method/][慎用python的__del__方法]] 比较详细分析了这个缺陷。
=__del__= 相当于C语言中的析构函数，但是问题是它不一定被调用。
也就是说如果你实现了 =__del__= 方法就不能出现循环引用，
否则垃圾回收器将因为不知道释放顺序而放弃释放。
下面是一个示例。

#+BEGIN_SRC python :exports both :results output
class A(object):
    def __init__(self, parent):
        print "A init"
        self.parent = parent

    def __del__(self):
        print "A del"

class B(object):
    def __init__(self):
        print "B init"
        self.child = A(self)

    def __del__(self):
        print "B del"

b = B()
#+END_SRC

#+RESULTS:
: B init
: A init

就凭这一点，程序员应该不要去实现 =__del__= 函数，
当然这个问题应该归罪于Python本身，既然有这么严重的问题，
就不应该给用户提供接口。

